<?php
class StudyModel extends Model {
    public function getSubjects() {
        return [
            [
                '№' => 1,
                'Дисциплина' => 'Экология',
                'Кафедра' => 'БЖ',
                'Всего часов' => 54,
                'Аудиторные' => 27,
                'Лк' => 18,
                'Лб' => 0,
                'Пр' => 9,
                'СРС' => 27
            ],
            [
                '№' => 2,
                'Дисциплина' => 'Высшая математика',
                'Кафедра' => 'ВМ',
                'Всего часов' => 540,
                'Аудиторные' => 282,
                'Лк' => 141,
                'Лб' => 0,
                'Пр' => 141,
                'СРС' => 258
            ],
            [
                '№' => 3,
                'Дисциплина' => 'Русский язык и культура речи',
                'Кафедра' => 'НГиГ',
                'Всего часов' => 108,
                'Аудиторные' => 54,
                'Лк' => 18,
                'Лб' => 0,
                'Пр' => 36,
                'СРС' => 54
            ],
            [
                '№' => 4,
                'Дисциплина' => 'Основы дискретной математики',
                'Кафедра' => 'ИС',
                'Всего часов' => 216,
                'Аудиторные' => 139,
                'Лк' => 87,
                'Лб' => 0,
                'Пр' => 52,
                'СРС' => 77
            ],
            [
                '№' => 5,
                'Дисциплина' => 'Основы программирования и алгоритмические языки',
                'Кафедра' => 'ИС',
                'Всего часов' => 405,
                'Аудиторные' => 210,
                'Лк' => 105,
                'Лб' => 87,
                'Пр' => 18,
                'СРС' => 195
            ],
            [
                '№' => 6,
                'Дисциплина' => 'Основы экологии',
                'Кафедра' => 'ПЭОП',
                'Всего часов' => 54,
                'Аудиторные' => 27,
                'Лк' => 18,
                'Лб' => 0,
                'Пр' => 9,
                'СРС' => 27
            ],
            [
                '№' => 7,
                'Дисциплина' => 'Теория вероятностей и математическая статистика',
                'Кафедра' => 'ИС',
                'Всего часов' => 162,
                'Аудиторные' => 72,
                'Лк' => 54,
                'Лб' => 18,
                'Пр' => 0,
                'СРС' => 90
            ],
            [
                '№' => 8,
                'Дисциплина' => 'Физика',
                'Кафедра' => 'Физики',
                'Всего часов' => 324,
                'Аудиторные' => 194,
                'Лк' => 106,
                'Лб' => 88,
                'Пр' => 0,
                'СРС' => 130
            ],
            [
                '№' => 9,
                'Дисциплина' => 'Основы электротехники и электроники',
                'Кафедра' => 'ИС',
                'Всего часов' => 108,
                'Аудиторные' => 72,
                'Лк' => 36,
                'Лб' => 18,
                'Пр' => 18,
                'СРС' => 36
            ],
            [
                '№' => 10,
                'Дисциплина' => 'Численные методы в информатике',
                'Кафедра' => 'ИС',
                'Всего часов' => 189,
                'Аудиторные' => 89,
                'Лк' => 36,
                'Лб' => 36,
                'Пр' => 17,
                'СРС' => 100
            ],
            [
                '№' => 11,
                'Дисциплина' => 'Методы исследования операций',
                'Кафедра' => 'ИС',
                'Всего часов' => 216,
                'Аудиторные' => 104,
                'Лк' => 52,
                'Лб' => 35,
                'Пр' => 17,
                'СРС' => 112
            ]
        ];
    }
}
?>